__author__ = "Монастыршин Никита"
"""
Задание 335В 
Дано натуральное число n. 
Вычислить:

https://ivtipm.github.io/Programming/Glava10/index10.htm#z335
"""
from Function7 import *


if __name__ == "__main__":
    n = int (input("Введите число n "))
    res = lab7(n)
    print(f"Результат = {res:.3f}")
