__author__ = "Монастыршин Никита"
"""
Создайте отдельные модули (или один) с набором функций.
"""

def print_res(res):
    print(f"Результат = {res:.3f}")

